{
    "topics" : [
        {
            "pattern" : "\\b(?:defining.a.game)\\b",
            "title" : "Defining a Game Element",
            "string" : "
WorldWeaver (WW) games are elements, just like everything else. An element has properties that we can set:

* key
* name
* type
* parent

There are more but those are covered in future topics. The above properties are what we need to define our
game element.

!NOTE!
    You can define your game element in any file. Organizing elements is up to you.
    However in this tutorial I'll show you how I, personally would organize my game elements.

Let's create a file to house our game element.
So within ~/GameSources/ShadowKeep let's create a file called game.nrmn.

In this file let's define our game element. Here is an example:

---

{key=game
    name=Shadow Keep
    type=game
    parent=root

    {type=enter_message
        output={@
Welcome to Shadow Keep.
        }
    }
}

---

One fun thing that you can do with this enter message is the use of ASCII art.
For example in a game that I am currently building I defined my game like this:


{key=game
    name=Dark World
    type=game
    parent=root

    {type=enter_message
        output={@
Something dark is happening throughout the continent of Aetherus.

Welcome to:

▓█████▄  ▄▄▄       ██▀███   ██ ▄█▀ █     █░ ▒█████   ██▀███   ██▓    ▓█████▄ 
▒██▀ ██▌▒████▄    ▓██ ▒ ██▒ ██▄█▒ ▓█░ █ ░█░▒██▒  ██▒▓██ ▒ ██▒▓██▒    ▒██▀ ██▌
░██   █▌▒██  ▀█▄  ▓██ ░▄█ ▒▓███▄░ ▒█░ █ ░█ ▒██░  ██▒▓██ ░▄█ ▒▒██░    ░██   █▌
░▓█▄   ▌░██▄▄▄▄██ ▒██▀▀█▄  ▓██ █▄ ░█░ █ ░█ ▒██   ██░▒██▀▀█▄  ▒██░    ░▓█▄   ▌
░▒████▓  ▓█   ▓██▒░██▓ ▒██▒▒██▒ █▄░░██▒██▓ ░ ████▓▒░░██▓ ▒██▒░██████▒░▒████▓ 
 ▒▒▓  ▒  ▒▒   ▓▒█░░ ▒▓ ░▒▓░▒ ▒▒ ▓▒░ ▓░▒ ▒  ░ ▒░▒░▒░ ░ ▒▓ ░▒▓░░ ▒░▓  ░ ▒▒▓  ▒ 
 ░ ▒  ▒   ▒   ▒▒ ░  ░▒ ░ ▒░░ ░▒ ▒░  ▒ ░ ░    ░ ▒ ▒░   ░▒ ░ ▒░░ ░ ▒  ░ ░ ▒  ▒ 
 ░ ░  ░   ░   ▒     ░░   ░ ░ ░░ ░   ░   ░  ░ ░ ░ ▒    ░░   ░   ░ ░    ░ ░  ░ 
   ░          ░  ░   ░     ░  ░       ░        ░ ░     ░         ░  ░   ░    
 ░                                                                    ░      


        }
    }
}

If you DO try something like this be aware of any characters that you may need to 'escape'.
(See _help escape characters)

Let's take a closer look at our game element.
You'll notice that we are defining its ElementKey using 'key'.
Any element that you might reference should have a unique key defined by you.
If you aren't going to reference it, simply don't define a key property in your element WW will assign
one for you, but you won't know what that is without opening up the database that is generated for your game.

We have given our game the unique kay of 'game'.
We have also defined the name of our game with the 'name' property.
Note that we have also specified the element's type as 'game'.

!NOTE!
    There can be only one element in your game with a type set to game.
    If you define more than one WW will grab the first element it encounters with that type
    so the behavior may be unexpected.


You may have noticed the 'parent' property is set to 'root'.
This means that is essentially doesn't have a parent. It is the top-most element.
We will discuss parents in the next topic.


There are some other required elements that we need to add to our game element.
",
            "links" : [
                "_help required game elements"
            ]
        }
    ]
}
