{
    "topics" : [
        {
            "pattern" : "\\b(?:tutorial.enter message)\\b",
            "title" : "Entering a Room Tutorial",
            "string" : "
Enter_message is a special type of element. It only fires when a player first enters a specific location.

Enter messages can be utilized by other element types as well. For instance, if you enter a room and there's an object in
that room, like a treasure chest. That element is defined as an 'object' element type. (We'll discuss objects shortly)
However it is in the room, so you can define a special message describing it when the player first enters the room.

(Note: If an object can be picked up, when it IS picked up, its parent element becomes 'player', so it is no longer described
along with the other room objects. However it can also me moved to other locations, and the same logic applies)


Let's give our room and enter message. Here's what our room definition looks like currently:

{key=local_pub, name=Local Pub, type=room, parent=root
    ...
}


With the enter message, it becomes:

{key=local_pub, name=Local Pub, type=room, parent=root
    {type=enter_message
        output={@
You are sitting in your local pub.
        }
    }
}


You may have noticed the '{' and '}' after the 'output='.
For output and logic, this specifies that there are multiple lines of text or logic for that field.

Also, you may have noticed the '@' after the '{', that specifies that any time you enter a line break, that should be part
of the output -- OR the logic in that field. MOST of the time, you want that present.
You can manually add a line break by using a backslash '\\' and a 'b'.

When should you exclude it?
When you want the output to wrap according to the size of the window, regardless of where you put line breaks in your
game definition.

The enter_message fires any time the player enters a room, so you do not need to define an Input or Action to kick it off.
Next, we'll look at Input elements, that can call Action elements.


_help tutorial messages
"
        }
    ]
}
